Revit 2027 API
RebarFreeFormAccessor Properties
The RebarFreeFormAccessor type exposes the following members.
Properties
Name | Description
AlignedFreeFormSetOrientationOptions | Obsolete.
 Orientation options for an Aligned Free Form Rebar set.
CycleCounter
Identifies the cycle counter. It can be zero or a pozitive number.
Its value is changed when the free form Rebar element is selected and the user press Space key -or- through the setter of this property -or- by the server if it considers that the counter reaches the maximum value and reset it (set it to 0). This property can be accessed just for Rebars that are controlled by a server.
FreeFormSetOrientationOptions |  Identifies the orientation options for an Aligned or 3D Path Free Form Rebar set.
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
RebarStyle |  Identifies the RebarStyle of the current Rebar element.
StirrupTieAttachmentType |  Identifies the StirrupTieAttachmentType of the current Rebar element. The RebarStyle of the Rebar element must be StirrupTie.
WorkshopInstructions |  Identifies the workshop instructions of the current Rebar element.
Top
See Also
Reference
RebarFreeFormAccessor Class
Autodesk.Revit.DB.Structure Namespace